Project/Toir/src/DataProcessors/торо_ОбщийПланРабот/торо_ОбщийПланРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ОбщийПланРабот</name>
  <tabularSections>
    <name>ВидыРемонтов</name>
    <attributes>
      <name>ВидСкользящегоПлана</name>
      <type>
        <types>CatalogRef.торо_ВидыСкользящихПланов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/Enums/торо_ДетализацияПлана/торо_ДетализацияПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ДетализацияПлана</name>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ДетализацияИсполнителя/торо_ДетализацияИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ДетализацияИсполнителя</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Бригада</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ВидыСкользящихПланов/торо_ВидыСкользящихПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыСкользящихПланов</name>
  <predefined>
    <items>
      <name>Годовой</name>
      <description>Годовой</description>
    </items>
    <items>
      <name>Долгосрочный</name>
      <description>Долгосрочный</description>
    </items>
    <items>
      <name>Оперативный</name>
      <description>Оперативный</description>
    </items>
    <items>
      <name>Среднесрочный</name>
      <description>Среднесрочный</description>
    </items>
    <items>
      <name>Стратегический</name>
      <description>Стратегический</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоОтображаемыхПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьПланирования</name>
    <type>
      <types>EnumRef.торо_ДетализацияПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсполнителяРабот</name>
    <type>
      <types>EnumRef.торо_ДетализацияИсполнителя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРемонтов</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_ОбщийПланРабот/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ВидыСкользящихПланов.Ссылка КАК ВидСкользящегоПлана,
	               |	торо_ВидыСкользящихПланов.Использование КАК Использование,
	               |	торо_ВидыСкользящихПланов.ПериодичностьПланирования КАК ПериодичностьПланирования,
	               |	торо_ВидыСкользящихПланов.ЧислоОтображаемыхПериодов КАК ЧислоОтображаемыхПериодов,
	               |	торо_ВидыСкользящихПланов.ТочностьПланирования КАК ТочностьПланирования,
	               |	торо_ВидыСкользящихПланов.ВидИсполнителяРабот КАК ВидИсполнителяРабот
				   |ИЗ
	               |	Справочник.торо_ВидыСкользящихПланов КАК торо_ВидыСкользящихПланов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ВидыСкользящихПлановВидыРемонтов.Ссылка КАК ВидСкользящегоПлана,
	               |	торо_ВидыСкользящихПлановВидыРемонтов.ВидРемонта КАК ВидРемонта
	               |ИЗ
	               |	Справочник.торо_ВидыСкользящихПланов.ВидыРемонтов КАК торо_ВидыСкользящихПлановВидыРемонтов";
	# КонецОбласти
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВидыСкользящихПланов.Загрузить(РезультатЗапроса[0].Выгрузить());
	Объект.ВидыРемонтов.Загрузить(РезультатЗапроса[1].Выгрузить());
	 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПередЗакрытием", ЭтаФорма);
		
		СписокКнопок = Новый СписокЗначений;
        СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да");
        СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Нет");
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("es='Hay en forma unos cambios no conservados. ¿Conservar los cambios ante el cierre?';ru='В форме имеются несохраненные изменения. Сохранить изменения перед закрытием?';en='There are unsaved changes in the form. Save changes before closing?'"), СписокКнопок); 
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	Объект.ВидыРемонтов.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидыСкользящихПлановПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВидыСкользящихПланов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Изменен = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтовПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВидыСкользящихПланов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыСкользящихПлановПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ВидыСкользящихПланов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Элементы.ВидыРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ВидСкользящегоПлана",ТекущиеДанные.ВидСкользящегоПлана));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыСкользящихПлановТочностьПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ВидыСкользящихПланов.ТекущиеДанные;
	Элемент.СписокВыбора.Очистить();
	Если Не ТекущиеДанные = Неопределено Тогда

		Если ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Стратегический") 
			ИЛИ ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Долгосрочный") Тогда
			
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Год"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Месяц"));
			
		ИначеЕсли ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Годовой") Тогда
			
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Месяц"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День"));
			
		ИначеЕсли ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Среднесрочный") Тогда
			
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День"));
		Иначе
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Час"));
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ВидыСкользящихПлановВидИсполнителяРаботНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВидыСкользящихПланов.ТекущиеДанные;
	Элемент.СписокВыбора.Очистить();
	Если Не ТекущиеДанные = Неопределено Тогда

		Если ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Стратегический") 
			ИЛИ ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Долгосрочный") 
			ИЛИ ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Годовой") Тогда
			
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияИсполнителя.Подразделение"));
						
		ИначеЕсли ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Среднесрочный") Тогда
			
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияИсполнителя.Подразделение"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияИсполнителя.Бригада"));
		Иначе
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияИсполнителя.Бригада"));
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ВидыСкользящихПлановПериодичностьПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВидыСкользящихПланов.ТекущиеДанные;
	Элемент.СписокВыбора.Очистить();
	Если Не ТекущиеДанные = Неопределено Тогда

		Если ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Стратегический") 
			ИЛИ ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Долгосрочный") 
			ИЛИ ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Годовой") Тогда
			
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
						
		ИначеЕсли ТекущиеДанные.ВидСкользящегоПлана = ПредопределенноеЗначение("Справочник.торо_ВидыСкользящихПланов.Среднесрочный") Тогда
			
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
		Иначе
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
			Элемент.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока и НЕ ОтменаРедактирования Тогда
		
		ТекущиеДанные   = Элементы.ВидыСкользящихПланов.ТекущиеДанные;
        ТекущаяСтрокаВР = Элементы.ВидыРемонтов.ТекущиеДанные;
		
		Если Не ТекущиеДанные = Неопределено
			И НЕ ТекущаяСтрокаВР = Неопределено Тогда
			ТекущаяСтрокаВР.ВидСкользящегоПлана = ТекущиеДанные.ВидСкользящегоПлана;
		КонецЕсли;
		
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	
	ЕстьОшибки = Ложь;
	
	Для каждого Строка Из ВидыСкользящихПланов Цикл
		Если Строка.Изменен Тогда
			ВидПлана = Строка.ВидСкользящегоПлана.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ВидПлана, Строка);
			ВидПлана.ВидыРемонтов.Очистить();
			
			СписокДобавленных = Новый СписокЗначений;
			
			МассивВидовРемонтов = Объект.ВидыРемонтов.НайтиСтроки(Новый Структура("ВидСкользящегоПлана", Строка.ВидСкользящегоПлана));
			
			Для каждого СтрокаСВидомРемонта Из МассивВидовРемонтов Цикл
				Если СписокДобавленных.НайтиПоЗначению(СтрокаСВидомРемонта.ВидРемонта) = Неопределено Тогда
					СписокДобавленных.Добавить(СтрокаСВидомРемонта.ВидРемонта);
					НС = ВидПлана.ВидыРемонтов.Добавить();
					НС.ВидРемонта = СтрокаСВидомРемонта.ВидРемонта;
				КонецЕсли; 
			КонецЦикла; 
			
			Попытка
				ВидПлана.Записать();
				Строка.Изменен = Ложь;
			Исключение
			   ТекстСообщения = НСтр("es='No consiguió conservar los cambios del tipo del plan que se desliza %1. La causa: %2';ru='Не удалось сохранить изменения вида скользящего плана %1. Причина: %2';en='Failed to save changes to the view of the moving plan %1. Reason: %2'");
			   Сообщение = Новый СообщениеПользователю;
			   ТекстСообщения = СтрШаблон(ТекстСообщения, Строка.ВидСкользящегоПлана, ОписаниеОшибки()); 
			   Сообщение.Текст = ТекстСообщения;
			   Сообщение.Сообщить(); 
			   ЕстьОшибки = Истина;
			КонецПопытки; 
			
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ЕстьОшибки Тогда
		Модифицированность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработкаПередЗакрытием(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНаСервере();
	Иначе
		Модифицированность = Ложь;
	КонецЕсли; 
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	торо_ОбновлениеИнформационнойБазы.ЗаполнениеВидовСкользящихПланов();
КонецПроцедуры

#КонецОбласти
